In [124]:
import pandas as pd
import numpy as np

In [115]:
A=pd.DataFrame({'a':[1],'b':[2],'c':[3],'d':[4],'e':[5]})
A.T

   0
a  1
b  2
c  3
d  4
e  5

In [116]:
#A df의 행들의 합을 구해보자.

In [117]:
A.reset_index(drop=True)
A

   a  b  c  d  e
0  1  2  3  4  5

In [118]:
A_sum=A.sum(axis=1)
A_sum

0    15
dtype: int64

In [82]:
#2.

In [83]:
Python1 = pd.DataFrame({'python':[0,3],'r':[1,4],'sql':[2,5]})
Python1

   python  r  sql
0       0  1    2
1       3  4    5

In [84]:
Python1.index = [2015,2016]

In [85]:
Python1

      python  r  sql
2015       0  1    2
2016       3  4    5

In [86]:
Python2 = pd.DataFrame({'python':[0,4,8],'r':[1,5,9],'sql':[2,6,10],'java':[3,7,11]})
Python2

   python  r  sql  java
0       0  1    2     3
1       4  5    6     7
2       8  9   10    11

In [87]:
Python2.index = [2014,2015,2016]
Python2

      python  r  sql  java
2014       0  1    2     3
2015       4  5    6     7
2016       8  9   10    11

In [88]:
Python1-Python2#뺄셈

      java  python    r  sql
2014   NaN     NaN  NaN  NaN
2015   NaN    -4.0 -4.0 -4.0
2016   NaN    -5.0 -5.0 -5.0

In [89]:
Python1+Python2#덧셈

      java  python     r   sql
2014   NaN     NaN   NaN   NaN
2015   NaN     4.0   6.0   8.0
2016   NaN    11.0  13.0  15.0

In [90]:
Python2/Python1#나눗셈

      java    python     r  sql
2014   NaN       NaN   NaN  NaN
2015   NaN       inf  5.00  3.0
2016   NaN  2.666667  2.25  2.0

In [91]:
Python1*Python2#곱셈

      java  python     r   sql
2014   NaN     NaN   NaN   NaN
2015   NaN     0.0   5.0  12.0
2016   NaN    24.0  36.0  50.0

In [92]:
#  Python1에는 java컬럼이 없기 때문에 사칙연산을 실행하면
#  NaN값이 나온다.

In [93]:
#3번

In [94]:
s= pd.DataFrame({'이름':['이서연','김민준'],'국어점수':[70,80],'수학점수':[80,70]})
s

    이름  국어점수  수학점수
0  이서연    70    80
1  김민준    80    70

In [95]:
# s.set_index('이름',inplace=True)

In [96]:
s

    이름  국어점수  수학점수
0  이서연    70    80
1  김민준    80    70

In [97]:
#아이유학생을 추가해보자.
s = s.append({'이름':'아이유','국어점수':90, '수학점수':90},ignore_index=True)
s

    이름  국어점수  수학점수
0  이서연    70    80
1  김민준    80    70
2  아이유    90    90

In [119]:
  df=pd.DataFrame({
      'A':[1,5,9],
      'B':[2,6,10],
      'C':[3,7,11],
      'D':[4,8,12],
  })

In [120]:
df

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [121]:
df.iloc[[0,2],:2]

   A   B
0  1   2
2  9  10

In [122]:
df.iloc[[0,2],:2].T

   0   2
A  1   9
B  2  10

In [125]:
df.iloc[[0,2],:2].T.apply(np.square)

   0    2
A  1   81
B  4  100

In [126]:
df.iloc[[0,2],:2].T.apply(np.square).iloc[0,1]

81